
#include "stdAfx.h"
#include "DualiP2pMg.h"

#define LOOPFLAGE_ACTIVE	0x00000001 //루프 안쪽 실행
#define LOOPFLAGE_END		0x00000002 //루프 안쪽 실행 안함
#define LOOPFLAGE_CLOSE		0x00000004 //루프 안쪽 실행 안함

#define SENDFLAGE_DATA		0x00000001 //데이타를 보낼 때
#define SENDFLAGE_FILE		0x00000002 //파일을 보낼 때
#define SENDFLAGE_NONE		0x00000004 //아무것도 보내지 않을 때
//--------------------------------------------------------------
//|
//|생성자
//|
//---------------------------------------------------------------
CDualiP2pMg::CDualiP2pMg():
debug(NULL),
bOk(FALSE),
dwSendflage(SENDFLAGE_NONE)
{}
//--------------------------------------------------------------
//|
//|소멸자
//|
//---------------------------------------------------------------
CDualiP2pMg::~CDualiP2pMg()
{
}
//--------------------------------------------------------------
//|
//|
//|
//---------------------------------------------------------------
void CDualiP2pMg::P2pObject()
{
}
//--------------------------------------------------------------
//|
//|
//|
//---------------------------------------------------------------
void CDualiP2pMg::CallThreadP2pFunc(int flag)
{
}
//--------------------------------------------------------------
//|
//|사용중인 객체를 메모리에서 제거한다
//|
//---------------------------------------------------------------
void CDualiP2pMg::Release()
{
}
//--------------------------------------------------------------
//|
//|선언된 객체를 생성한다
//|
//---------------------------------------------------------------
void CDualiP2pMg::initInterfaceObject(IMyObject* _obj)
{
	//========================================
	// 오브젝트 관리 생성 관리 클래스
	//========================================
	obj=_obj;
	//========================================
	// 디버그 출력 클래스
	//========================================
	debug=obj->GetOutputObject();
	//========================================
	// 듀얼 아이 라이브러리 클래스
	//========================================
	dualicard = obj->GetDualiCardMgObject();
	//버퍼 초기화
	//송신 데이타
	SendData="";
	//수신 데이타
	RecvData="";
}
//--------------------------------------------------------------
//|
//|Send (보낼 데이터가 있을 때
//|
//---------------------------------------------------------------
BOOL CDualiP2pMg::SendDatafn(DWORD _dwSendflage, CString data, DWORD dwTimeout)
{
	bOk=FALSE;
	return bOk;
}
