
#ifndef __UDPWINSOCKETSERVER_74F736E25AB94b5dA789E4730F58F2A1_H__
#define __UDPWINSOCKETSERVER_74F736E25AB94b5dA789E4730F58F2A1_H__

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

class CUdpWinSocketServer : public IUdpWinSocket
{
public:
	//생성자
	CUdpWinSocketServer();
	//소멸자
	~CUdpWinSocketServer();
	//=================스래드 함수===========================//
	static DWORD WINAPI teleProcess(LPVOID lpArg);

	//=======================================================//
	//			변수 선언
	//======================================================//
	CThread  serverThread;
	BOOL bClose;
	SOCKET server_sock;
	//======================================================//
	//			인터페이스 객체 선언
	//======================================================//
	IMyObject* obj;
	IOutput* debug;
	//======================================================//
	//			인터페이스 포인터 
	//======================================================//

	//======================================================//
	//			일반 함수
	//======================================================//
	//윈속 초기화
	void initWinSocket();
	//=======================================================//
	//======================================================//
	//			변수
	//======================================================//
	//======================================================//
	//			인터페이스 선언 재 정의 함수
	//======================================================//
	//초기 생성 
	virtual void initInterfaceObject(IMyObject* _obj);
	//클래스에 있는 객체 메모리 해제
	virtual void Release();
	BOOL MakeUdpServer(u_short _port, CString _ip);
	//UDP 통신 스래드 호출  함수
	virtual void TeleUdpfunc();
	//=======================================================//
};
#endif// __UDPWINSOCKETSERVER_74F736E25AB94b5dA789E4730F58F2A1_H__
