
#ifndef __CLASSOBJECT_74F736E25AB94b5dA789E4730F58F2A1_H__
#define __CLASSOBJECT_74F736E25AB94b5dA789E4730F58F2A1_H__

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

class CClassObject : public IMyObject
{
public:
	//생성자
	CClassObject();
	//소멸자
	~CClassObject();

//======================================================//
//			일반함수 선언
//======================================================//
//=================스래드 함수===========================//
	static DWORD WINAPI KillProcess(LPVOID lpArg);
//=======================================================//
//			변수 선언
//======================================================//
public:
	CThread  mKillthread;
	CEvent  mhKillEvent;
//======================================================//
//			인터페이스 객체 선언
//======================================================//
	IOutput* debug;
	IMainGdiDlg* maingdi;
	IServer* selectserver;
//======================================================//
//			인터페이스 포인터 
//======================================================//

//=======================================================//
//======================================================//
//			인터페이스 선언 재 정의 함수
//======================================================//
	//오브젝트 객체를 메모리 해제한다
	virtual void KillObject();
	//메모리 해제 
	virtual void Release();
	//===================================
	// 실행되면서 생성되는 오브젝트 클래스
	//==================================
	virtual BOOL CreateObject();
	//===================================
	// 생성 객체 초기화 (오프젝트 클래스의 포인터를 넘긴다)
	//==================================
	virtual BOOL initObject();
	//===================================
	// 
	//==================================
	//======================================================//
	//	디버그 출력 클래스 객체를 넘긴다
	//======================================================//
	virtual IOutput* GetOutputObject();
	//------------------------------------
	//======================================================//
	//	GdiDlg 클래스 객체를 넘긴다
	//======================================================//
	//메인 Dlg 클래스를 오브젝트 생성 클래스에 추가한다
	virtual void AddMainGdiDlgObject(IMainGdiDlg* _maingdi);
	//메인  dlg 연결 클래스
	virtual IMainGdiDlg* GetMainGdiObject();
	//======================================================//
	//	SelectServer 클래스 객체를 넘긴다
	//======================================================//
	virtual IServer* GetSelectServerObject();
//=======================================================//
};
#endif// __CLASSOBJECT_74F736E25AB94b5dA789E4730F58F2A1_H__
