
#ifndef __MYSQLDB_74F736E25AB94b5dA789E4730F58F2A1_H__
#define __MYSQLDB_74F736E25AB94b5dA789E4730F58F2A1_H__

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000
//======================================================//
//			전역 객체 선언
//======================================================//

//=======================================================//

class CMysqlDb : public IMysqlDb
{
public:
	//생성자
	CMysqlDb();
	//소멸자
	~CMysqlDb();
//======================================================//
//			일반함수 선언
//======================================================//
	BOOL Open(char* UserName, char* Pwd,char* CnnStr);
	BOOL OpenTbl(int Mode, char* CmdStr);
	BOOL Execute(char* CmdStr);
	//BOOL Execute(char* CmdStr);
//=================스래드 함수===========================//

//=======================================================//
//			객체 포인터 변수
//======================================================//
	IMyObject* obj;
	IOutput* debug;
	IMysqlDbtable* mysqltable;
//=======================================================//
//			변수 선언
//======================================================//
public:
	CnnPtr m_Cnn;
private:

//======================================================//
//			인터페이스 선언 재 정의 함수
//======================================================//
	virtual void Release();
	virtual BOOL initMysqlDb(IMyObject* _obj);

//=======================================================//

};
#endif// __MYSQLDB_74F736E25AB94b5dA789E4730F58F2A1_H__
