
#ifndef __IMYOBJECT_74F736E25AB94b5dA789E4730F58F2A1_H__
#define __IMYOBJECT_74F736E25AB94b5dA789E4730F58F2A1_H__

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

//--------------------------------------------------------------
//|
//|IServer 인터페이스
//|
//---------------------------------------------------------------
interface IMyObject
{
	//오브젝트 객체를 메모리 해제한다
	virtual void KillObject()=0;
	//메모리 해제 
	virtual void Release()=0;
	//===================================
	// 실행되면서 생성되는 오브젝트 클래스
	//==================================
	virtual BOOL CreateObject()=0;
	//===================================
	// 실행되면서 생성되는 오브젝트 클래스 객체를 넘긴다
	//==================================
	//--------------------------------
	// 디버그 출력 클래스
	virtual IOutput* GetOutputObject()=0;
	//------------------------------------
	// 듀얼아이 단말기 DLL  메니저 클래스
	virtual IDualiCardMg* GetDualiCardMgObject()=0;
	//======================================================//
	//	GdiDlg 클래스 객체 생성
	//======================================================//
	virtual IGdiDlg* GetMainGdiObject()=0;
};

#endif //__IMYOBJECT_74F736E25AB94b5dA789E4730F58F2A1_H__