
#include "stdAfx.h"
#include "../OutputDebug/OutputDebug.h"
#include "../Duali/Duali.h"

//--------------------------------------------------------------
//|
//|생성자
//|
//---------------------------------------------------------------
CClassObject::CClassObject():
debug(NULL),
mKillthread(NULL),
mhKillEvent(NULL)
{}
//--------------------------------------------------------------
//|
//|소멸자
//|
//---------------------------------------------------------------
CClassObject::~CClassObject()
{
}
//--------------------------------------------------------------
//|
//|사용중인 객체를 메모리에서 제거한다
//|
//---------------------------------------------------------------
void CClassObject::KillObject()
{
	////////////////////////////////////////////////////////////////
	//종료 스레드 생성
	//종료 스레드 생성
	mhKillEvent.Create();
	mKillthread.Create(KillProcess, (LPVOID)this);
	if(mhKillEvent.WaitForEvent())
	{
	}
	mKillthread.WaitForThread();
}
//--------------------------------------------------------------
//|
//|사용중인 객체를 메모리에서 제거한다
//|
//---------------------------------------------------------------

//--------------------------------------------------------------
//|
//| 메모리를 해제하기 위한 스래드
//|
//---------------------------------------------------------------
DWORD WINAPI CClassObject::KillProcess(LPVOID lpArg)
{
	IMyObject *obj = (IMyObject *)lpArg;
	if(obj)
		obj->Release();
	return 0;
}
//--------------------------------------------------------------
//|
//|사용중인 객체를 메모리에서 제거한다
//|
//---------------------------------------------------------------
void CClassObject::Release()
{
	//|=============================================
	//|메모리 해제
	//|==================================================
	//|=============================================
	//|듀얼아이 카드 클래스 해제
	//|==================================================
	dualicard->Release();
	delete ((CDualiCardMg*)dualicard);	dualicard=NULL;
	//|=============================================
	//|듀얼 아이 P2P 클래스 해제
	//|==================================================
	dualip2p->Release();
	delete ((CDualiP2pMg*)dualip2p);	dualip2p=NULL;

	//|=============================================
	//|디버그 출력 창을 제일 나중에 종료한다
	//|==================================================
	Sleep(1000);
	if(debug)
	{
		debug->Release();
#ifdef _DEBUG
		delete ((CTraceWinDebug*)debug);	debug=NULL;
#else
		delete ((CTraceFileDebug*)debug);	debug=NULL;
#endif
	}
	//|=============================================
	//|사용중인 객체의 메모리를 모두 해제 했으면
	//|==================================================
	mhKillEvent.SetEvent();
}
//--------------------------------------------------------------
//|
//|선언된 객체를 생성한다
//|
//---------------------------------------------------------------
BOOL CClassObject::CreateObject(IMainGdiDlg* _maingdi)
{
	maingdi = _maingdi;
#ifdef _DEBUG
	debug = new CTraceWinDebug(_T("NFC_Debug"));
#else
	debug = new CTraceFileDebug(_T("NFC_Debug"));
#endif
	//|=============================================
	//|듀얼아이 카드 클래스 생성
	//|==================================================
	dualicard = new CDualiCardMg;
	//|=============================================
	//|듀얼 아이 P2P 클래스 생성
	//|==================================================
	dualip2p = new CDualiP2pMg;
	return TRUE;
}
//--------------------------------------------------------------
//|
//|객체 초기화
//|
//---------------------------------------------------------------
BOOL CClassObject::initObject()
{
	//|=============================================
	//|디버크 출력 클래스 초기화
	//|==================================================
	debug->initInterfaceObject(this);
	//|=============================================
	//|듀얼아이 카드 클래스 초기화
	//|==================================================
	dualicard->initInterfaceObject(this);
	//|=============================================
	//|듀얼 아이 P2P 클래스 초기화
	//|==================================================
	dualip2p->initInterfaceObject(this);
	return TRUE;
}
//--------------------------------------------------------------
//|
//|MainDlg Gdi 클래스
//|
//---------------------------------------------------------------
IMainGdiDlg* CClassObject::GetMainGdiDlgObject()
{
	return maingdi;
}
//--------------------------------------------------------------
//|
//|생성된 클래스 인터페이스 객체 포인터 넘기는 함수
//|
//---------------------------------------------------------------
//--------------------------------------------------------------
//|
//|디버그 출력 클래스
//|
//---------------------------------------------------------------
IOutput* CClassObject::GetOutputObject()
{
	return debug;
}
//--------------------------------------------------------------
//|
//|듀얼아이 카드 클래스
//|
//---------------------------------------------------------------
IDualiCardMg* CClassObject::GetDualiCardMgObject()
{
	return dualicard;
}
//--------------------------------------------------------------
//|
//|듀얼아이 P2P 클래스
//|
//---------------------------------------------------------------
IDualiP2pMg* CClassObject::GetDualiP2pMgObject()
{
	return dualip2p;
}